import random
import sys

import mathematics
import geography
import physics
import general




def get_user_input():
    return input('User: ')


def math():
    global help
    while True:
        print("Bot: Ви обрали тему Математика."
              "Ви можете задати мені питання з наступних тем:обчислення довжини дуги кола,площа трикутника"
              " за допомогою векторного добутку,площа трапеції")
        user_input = get_user_input()
        if user_input == "назад":
            break
        if user_input == "допомога":
            print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
            help = get_user_input()
        if help == "вихід":
            print("Рада була поспілкуватися,до зустрічі")
            sys.exit()
        elif help == "назад":
            break
        if user_input == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
        if user_input == "обчислення довжини дуги кола":
            print("Bot: Ви обрали операцію обчислення довжини дуги кола.Введіть радіус кола: ")
            r = float(get_user_input())
            print("Bot: Введіть кут між двома точками на колі, який вимірюється в радіанах.")
            o = float(get_user_input())
            print("Bot: Довжина дуги кола = ", mathematics.arc(r, o))
            continue
        if user_input == "площа трикутника за допомогою векторного добутку":
            print("Bot: Ви обрали операцію площа трикутника за допомогою векторного добутку.Введіть вектор А: ")
            A = float(get_user_input())
            print("Bot: Введіть вектор В: ")
            B = float(get_user_input())
            print("Bot: Площа трикутника = ", mathematics.square(A,B))
            continue
        if user_input == "площа трапеції":
            print("Bot: Ви обрали операцію площа трапеції.Введіть сторону а: ")
            a = float(get_user_input())
            print("Bot: Введіть сторону в: ")
            b=float(get_user_input())
            print("Bot: Введіть висоту h: ")
            h=float(get_user_input())
            print("Bot: Площа трапеції: ", mathematics.trapeze_square(a,b,h))
            continue
        else:
            print("Bot: Я не знаю цієї теми,натомість ви можете задати питання з наступних тем:обчислення "
                  "довжини дуги кола,площа трикутника"
              " за допомогою векторного добутку,площа трапеції")




def phys():
    global help
    while True:
        print("Bot: Ви обрали тему Фізика. Ви можете задати мені питання з наступних тем:рівняння Ейнштейна,"
              "гравітаційна стала,стала Планка")
        user_input = get_user_input()
        if user_input == "назад":
            break
        if user_input == "допомога":
            print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
            help = get_user_input()
        if help == "вихід":
            print("Рада була поспілкуватися,до зустрічі")
            sys.exit()
        elif help == "назад":
            break
        if user_input == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
        if user_input == "рівняння Ейнштейна":
            print("Bot:Ви обрали операцію рівняння Ейнштейна.Введіть масу тіла m: ")
            m = get_user_input()
            print("Bot: Введіть швидкість світла с: ")
            c = get_user_input()
            print("Bot: Рівняння Ейнштейна: ", physics.equation(m, c))
            continue
        if user_input == "гравітаційна стала":
            print("Bot:Ви обрали операцію гравітаційна стала.Введіть значення F:")
            F = get_user_input()
            print("Bot:Введіть значення r:")
            r = get_user_input()
            print("Bot: Введіть значення m1:")
            m1 = get_user_input()
            print("Bot: Введіть значення m2:")
            m2 = get_user_input()
            print("Bot: Гравітаційна стала: ", physics.gravitation(F, r, m1, m2))
            continue
        if user_input == "стала Планка":
            print("Bot:Ви обрали операцію стала Планка.Введіть значення E: ")
            E = get_user_input()
            print("Bot: Введіть значення v:")
            v = get_user_input()
            print("Bot: Стала Планка: ", physics.planka(E, v))
            continue
        else:
            print("Bot: Я не знаю цієї теми,натомість,ви можете задати мені питання з наступних тем:рівняння Ейнштейна,"
              "гравітаційна стала,стала Планка")


def geogr():
    global help
    while True:
        print("Bot: Ви обрали тему Географія. Ви можете задати мені питання з наступних тем:найбільший океан за площею,"
              "де знаходиться Сахара,знаходження координати В,знаходження відстані між двома точками")
        user_input = get_user_input()
        if user_input == "назад":
            break
        if user_input == "допомога":
            print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
            help = get_user_input()
        if help == "вихід":
            print("Рада була поспілкуватися,до зустрічі")
            sys.exit()
        elif help == "назад":
            break
        if user_input == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
        if user_input == "найбільший океан за площею":
            print("Bot: Найбільший океан за площею-Тихий океан.Його площа - 178,7 млн. км2.")
            continue
        if user_input == "де знаходиться Сахара":
            print("Bot: Сахара знаходиться у Північній Африці.")
            continue
        if user_input == "знаходження координати В":
            print("Bot: Ви обрали підтему знаходження координати В.Введіть значення координати А,x1:")
            x1 = get_user_input()
            print("Bot: Введіть значення координати А,y1:")
            y1 = get_user_input()
            print("Bot: Введіть значення відстані d:")
            d = get_user_input()
            print("Bot: Введіть значення кута в радіанах:")
            corner = get_user_input()
            print("Bot: Значення координати В: ", geography.coordinate(x1, y1, d, corner))
            continue
        if user_input == "знаходження відстані між двома точками":
            print("Bot: Ви обрали підтему знаходження відстані між двома точками.Введіть значення координати А,х1:")
            x1 = get_user_input()
            print("Вot: Введіть значення А,у1:")
            y1 = get_user_input()
            print("Вot: Введіть значення B,x2:")
            x2 = get_user_input()
            print("Вot: Введіть значення B, y2:")
            y2 = get_user_input()
            print("Вot: Відстань між двома точками: ", geography.distance(x1, x2, y1, y2))
            continue
        else:
            print("Bot:Я не знаю цієї теми,натомість ви можете задати питання з наступних тем:найбільший океан за"
                  " площею,"
              "де знаходиться Сахара,знаходження координати В,знаходження відстані між двома точками")

def phil():
    global help
    while True:
        print("Bot: Ви обрали тему Філологія. Ви можете задати мені питання з наступних тем:як утворити passive voice "
              "в present simple,яка різниця між іменником та прикметником")
        user_input = get_user_input()
        if user_input == "назад":
            break
        if user_input == "допомога":
            print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
            help = get_user_input()
        if help == "вихід":
            print("Рада була поспілкуватися,до зустрічі")
            sys.exit()
        elif help == "назад":
            break
        if user_input == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
        if user_input == "як утворити passive voice в present simple":
            print("Bot: Пасивний стан в Present Simple утворюється за допомогою: дієслова to be в теперішньому часі "
                  "(am,is,are);дієслова в минулому часі.В англійській мові є правильні та неправильні дієслова.Залежно "
                  "від дієслова ми:додаємо закінчення -ed,якщо дієслово правильне;ставимо його в 3-ю форму,якщо "
                  "дієслово неправильне.Схеми побудови пасивного стану в present simple буде наступною.Предмет/людина"
                  "+ am/is/are+3-тя форма неправильного дієслова або правильне дієслово з закінченням -ed")
            continue
        if user_input == "яка різниця між іменником та прикметником":
            print("Bot: іменники позначають предмет. Розпізнати їх нескладно, задавши до слова питання (хто?) "
                  "Або (що?). Дівчинка, камінь, пошта, смуток, радість, сніг, дощ.Прикметники характеризують"
                  " предмет, позначають його ознака, тому до них можна застосувати"
                  " питання (який?), (яка?), (який?), (які?), (чий?), (чия?), (чиє? і чиї?) . "
                  "Велика, могутній, синє, татів, мамина, білячі.")
            continue
        else:
            print("Bot: Я не знаю цієї теми,натомість ви можете задати питання з наступних тем:"
                  "як утворити passive voice "
              "в present simple,яка різниця між іменником та прикметником")

def astr():
    global help
    while True:
        print("Bot: Ви обрали тему Астрономія. Ви можете задати мені питання з наступних тем:яка відстань між Землею"
              "та Сонцем,які типи зірок відомі в астрономії,що таке чорні діри та як вони виникають")
        user_input = get_user_input()
        if user_input == "назад":
            break
        if user_input == "допомога":
            print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
            help = get_user_input()
        if help == "вихід":
            print("Рада була поспілкуватися,до зустрічі")
            sys.exit()
        elif help == "назад":
            break
        if user_input == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
        if user_input == "яка відстань між Землею та Сонцем":
            print("Bot: Відстань між Землею та Сонцем ≈149,6 млн. км")
            continue
        if user_input == "які типи зірок відомі в астрономії":
            print("Bot: Типи зірок за світлом і теплом: Гіпергігантські зірки,Супергігантські зірки,Гігантські зірки,"
                  "Підгігантські зірки,Карликові зірки,Підкарликові зірки,Білі карликові зірки")
            continue
        if user_input == "що таке чорні діри та як вони виникають":
            print("Bot: Чорна діра – це місце в космосі, куди сила тяжіння затягує настільки сильно, "
                  "що навіть світло не може чинити опір. Сила тяжіння там настільки сильна, тому що речовина була"
                  " стиснута в крихітний простір. Чорна діра може виникнути, коли зірка вмирає. Оскільки "
                  "світло не виходить, люди не можуть бачити чорні діри. ")
            continue
        else:
            print("Bot: Я не знаю цієї теми,натомість ви можете задати питання з наступних тем:яка відстань між Землею"
              "та Сонцем,які типи зірок відомі в астрономії,що таке чорні діри та як вони виникають")

def gen():
    global help
    while True:
        print("Bot: Ви обрали тему Загальні. Ви можете задати мені питання з наступних тем:котра година,пограти у "
              " вгадай число між 1 та 10,пограти у камінь-ножиці-папір,яка зараз дата,як тебе звати,заспівати "
              "улюблену пісню,зачитати вірш,сказати надихаючу цитату,заспівати колядку")
        user_input = get_user_input()
        if user_input == "назад":
            break
        if user_input == "допомога":
            print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
            help = get_user_input()
        if help == "вихід":
            print("Рада була поспілкуватися,до зустрічі")
            sys.exit()
        elif help == "назад":
            break
        if user_input == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
        if user_input == "котра година":
            print("Bot:  ", general.times())
            continue
        if user_input == "пограти у вгадай число між 1 та 10":
            print("Bot: Введіть число від 1 до 10")
            a = int(get_user_input())
            b=random.randint(1, 10)
            if a != b:
                message=f"Bot: Ви не вгадали число.Це число {b}."
                print(message)
            else:
                print("Bot:Вітаю! Число вгадане!")
            continue
        if user_input == "пограти у камінь ножиці папір":
            ver = 0
            while (ver == 0):
                player = int(input("Bot: 1-камінь,2-ножиці,3-папір: "))
                if (player == 1 or player == 2 or player == 3):
                    ver = 1
            if player == 1:
                print("Ви обрали камінь")
            if player == 2:
                print("Ви обрали ножиці")
            if player == 3:
                print("Ви обрали папір")
            comp = random.randint(1, 3)
            if comp == 1:
                print("Bot обрав камінь")
            if comp == 2:
                print("Bot обрав ножиці")
            if comp == 3:
                print("Bot обрав папір")
            if player == comp:
                win = 0
            if player == 1 and comp == 2:
                win = 1
            if player == 1 and comp == 3:
                win = 2
            if player == 2 and comp == 1:
                win = 2
            if player == 2 and comp == 3:
                win = 1
            if player == 3 and comp == 1:
                win = 1
            if player == 3 and comp == 2:
                win = 2
            if win == 0:
                print("Нічия!")
            if win == 1:
                print("Виграв гравець!")
            if win == 2:
                print("Виграв Bot!")
                continue
        if user_input == "яка зараз дата":
            print("Bot: ",general.dates())
            continue
        if user_input == "як тебе звати":
            print("Bot: Мене звати Вот")
            continue
        if user_input == "заспівати улюблену пісню":
            print("Bot: Стефанія мамо, мамо Стефанія Розквітає поле, а вона сивіє Заспівай мені, мамо, колискову "
                  "Хочу ще почути твоє рідне слово")
            print("Bot: На льодяній підлозі такі солодкі сльози Крапають, крапають З вік моїх в ріки І нема, "
                  "і нема від цього ліків")
            print("Bot: Старі фотографії на стіл розклади Дитячі історії смішні розкажи І справжнім друзям, "
                  "не забудь, подзвони "
                  "Бо, добре чи зле, з тобою завжди вони")
            print("Bot: Сльози, першою росою Повернусь додому я обов'язково У батьківській хаті яскравіші зорі "
                  "Вчила мене мати, співала колискову")
            print("Bot:Я шукаю погляд твій... Де ж ти загубилась?..Ти втекла із моїх снів І в серці поселилась, "
                  "Та холодним полум'ям Очі твої сяють, Ніби, злі два добермани Мене покусають...")
            continue
        if user_input == "зачитати вірш":
            print("Bot: Як не любить той край, Де вперше ти побачив Солодкий дивний світ, Що ми звемо життям, "
                      "Де вперше став ходить І квіткою неначе В його теплі зростав І усміхавсь квіткам! ")
            print("Bot: Наша славна Україна,  Наше щастя і наш рай,  Чи на світі є країна  Ще миліша за наш край? "
                      "І в щасливі й злі години  Ми для неї живемо.  На Вкраїні й для Вкраїни  Будем жити й помремо.")
            print("Bot: Україно моя, моя люба Вкраїно, Чим я втішу тебе, чим тебе заспокою? — "
                      "Чи про те розкажу, як тебе я люблю, А чи піснею горе твоє я присплю, Чи слізьми "
                      "розіллюсь, мов сирітська дитина, —- Чим тебе заспокою я — бідна людина,- Скажи, "
                  "моя люба Вкраїно, "
                      "Вкраїно моя!")
            print("Bot: Росте помаленьку Оленка Та й каже: - Бабусю рідненька! Мене ви не дуже хваліть, "
                      "Я знаю, - мені вже п'ять літ, - Найкраща у світі не я, Найкраща матуся моя!")
            print("Bot: Мамині руки – щедрі, робочі – Втоми не знають з ранку до ночі. "
                      "Вранці, коли ще усі спочивають, Сонце, напевно, вони піднімають."
                      " Мамині руки – ніжні і мілі – Воду ранкову з криниці носили. "
                      "Діти плескались, діти вмивались, Сонцю і матері щиро всміхались.")
            continue
        if user_input == "сказати надихаючу цитату":
            print("Bot: Ти повинен займатися тим, що робить тебе щасливим. Забудь про гроші або інші пастки, "
                  "які заведено вважати успіхом. У тебе всього одне життя")
            print("Bot: Стрес — це не те, що з вами сталося, а те, як ви це сприймаєте")
            print("Bot: Зміни — закон життя. І ті, хто дивиться тільки в минуле чи лише на сьогодення, "
                  "пропустять майбутнє")
            print("Bot: Коли все, здається, йде проти вас, пам’ятайте, що літак злітає проти вітру, а не з ним")
            print("Bot: Успіх — це вміння рухатись від невдачі до невдачі, не втрачаючи ентузіазму")
            continue
        if user_input == "заспівати колядку":
            print("Bot: Коляд, коляд, колядниця, Добра з медом паляниця, А без меду не така, Дайте, дядьку, п’ятака. "
                  "Одчиняйте скриньку, Та давайте сливку, Одчиняйте сундучок, Та давайте п’ятачок. ")
            print("Bot: Ой радуйся, земле! Коляда іде! Коляда іде, всім дари везе. "
                  "Всім дари везе, нам слово каже. Нам слово каже, що весь світ сяє. "
                  "Земле, земле, одчиняй двері. Одчиняй двері , бо твій князь їде!")
            print("Bot: Сніг на землю сипле тихо, На душі велика втіха. Віфліємська зірка сяє Та Ісуса прославляє. ")
            print("Bot: Віє вітер з гір Та до вас у двір, Проситься до хати Заколядувати. Ви його почуйте, "
                  "Смакоту готуйте! Бога прославляйте, Нас не забувайте!")
            print("Bot: Колядую, колядую, Вашi грошi добре чую, Смак цукерок, пирога, Подавайте п’ятака")
            continue
        else:
            print("Bot: Я не знаю цієї теми,натомість ви можете задати питання з наступних тем:котра година,пограти у "
              " вгадай число між 1 та 10,пограти у камінь-ножиці-папір,яка зараз дата,як тебе звати,заспівати "
              "улюблену пісню,зачитати вірш,сказати надихаючу цитату,заспівати колядку")



















while True:
    print("Bot: Вітаю,мене звати Бот.Ви можете задати мені питання з наступних тем:математика,"
          "фізика,географія,філологія,астрономія,загальні")
    user_input = get_user_input()
    help = ""
    if user_input == "математика":
        math()
    if user_input == "фізика":
        phys()
    if user_input == "географія":
        geogr()
    if user_input == "філологія":
        phil()
    if user_input == "астрономія":
        astr()
    if user_input == "загальні":
        gen()
    if user_input == "допомога":
        print("Bot: Для виходу,напишіть вихід. Для повернення до останньої теми напишіть назад")
        help = get_user_input()
        if help == "вихід":
            print("Bot: Рада була поспілкуватися,до зустрічі")
            sys.exit()
    if user_input == "вихід":
        print("Bot: Рада була поспілкуватися,до зустрічі")
        sys.exit()
    else:
        print("Bot: Я не знаю цієї теми,натомість ви можете задати мені питання з наступних тем: математика,"
          "фізика,географія,філологія,астрономія,загальні")

